[
  "I often spend money without considering whether it could be put to better use elsewhere.",
  "I don't really think too much about the future – whatever is going to happen will happen.",
  "I am too busy worrying about today to really plan far in advance.",
  "I am saving as much money as I possibly can.",
  "I am willing to make sacrifices now to put more money in my savings account.",
  "I have specific plans for how I will achieve my goals.",
  "I feel panicky when an unexpected expense arises.",
  "I worry about money all the time.",
  "I can become distressed when making decisions involving money.",
  "I would rather save money than spend it.",
  "I try to avoid going into debt whenever possible.",
  "I usually think carefully about making a new purchase.",
  "It feels good to spend money on myself.",
  "I usually make decisions very quickly.",
  "I tend to buy things I hadn't planned to buy.",
  "I usually get depressed after making a financial decision.",
  "I expect my financial situation will always stay the same or get worse.",
  "If I am not careful, people will try to take advantage of me.",
  "If I got a juicy stock tip, I would invest some money, as long as it fit into my budget.",
  "When hit with an unexpected financial setback, I know I'll find a way to work it out.",
  "I know if I needed to quit my job I would be OK.",
  "I only purchase car insurance because it's required, not because I'll ever need it.",
  "When I play the lottery or gamble, it's because I believe I will beat the odds.",
  "I tend to be better than most people at most things.",
  "I often rely on my friends or family for financial advice.",
  "I enjoy buying really nice gifts for people.",
  "I would spend outside of my budget in order to join friends or family at an expensive restaurant.",
  "I am in a better position than anyone else to make decisions about my finances.",
  "It is annoying when others tell me how I should spend my money.",
  "Most of the time I tend to make financial decisions without receiving any advice.",
  "I am comfortable letting someone else in my life make all of the major financial decisions.",
  "I avoid talking about money because I feel that people will judge me.",
  "I tend to avoid thinking about money.",
  "I always know the balance in my checking account.",
  "I have all of my important documents (such as insurance policies) carefully stored where I can find them.",
  "Paying my bills on time each month gives me a good feeling.",
  "I would quit a job without having another job if I was unhappy.",
  "I tend to get bored easily.",
  "I feel that life is an adventure.",
  "I believe money is meant to be enjoyed.",
  "Going shopping makes me feel better.",
  "I would go on vacation and put it all on a credit card."
]